straight_curdin/app/controllers/cheeses_controller.rb

SELECT "cheeses".* FROM "cheeses"
---
  def index
    @cheeses = Cheese.all

SELECT  "cheeses".* FROM "cheeses" WHERE "cheeses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @cheese = Cheese.find(params[:id])

INSERT INTO "cheeses" ("name", "milk_type", "description", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @cheese = Cheese.new(cheese_params)

    if @cheese.save

SELECT  "cheeses".* FROM "cheeses" WHERE "cheeses"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @cheese = Cheese.find(params[:id])

SELECT  "cheeses".* FROM "cheeses" WHERE "cheeses"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cheeses" SET "name" = $1, "milk_type" = $2, "description" = $3, "image_url" = $4, "updated_at" = $5 WHERE "cheeses"."id" = $6  [["name", "test2"], ["milk_type", "test2"], ["description", "test2"], ["image_url", "2test"], ["updated_at", "2018-03-05 02:32:20.636793"], ["id", 10]]
---
  def update
    @cheese = Cheese.find(params[:id])

    if @cheese.update(cheese_params)

SELECT  "cheeses".* FROM "cheeses" WHERE "cheeses"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "cheeses" WHERE "cheeses"."id" = $1  [["id", 9]]
---
  def destroy
    @cheese = Cheese.find(params[:id])
    @cheese.destroy

SELECT "cheeses".* FROM "cheeses"
SELECT  "cheeses".* FROM "cheeses" WHERE "cheeses"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def random
    max = Cheese.all.length
    ran_num = rand(1..max)
    @cheese = Cheese.find(ran_num)